package com.green.Note;

public class Note1 {
    public static void main(String[] args) {
    /*
    객체  - 속성(맴버 필드, 속성, property,전역변수)
          - 메소드(맴버 메소드)

          클래스           객체(object),Instance
     ----------------------------------------------------
          문서     --->
          설계도   --->        아파트,Tv,제품
          설명     --->
     */
        //------------------------------------------------

    /*  다형성
    1. 부모타입은 자식 객체 주소값 담을 수 있다.
    2. 자식타입은 부모 객체 주소값 담을 수 없다.
    3. 타입은 알고 있는 메소드만 호출할 수 있고, 호출이 된다면 객체 기준이다.
     */

        //instance를 사용하지 않는다면 static Method를 사용 할수 있다
    }
}


